# Optimizing Short-Term Rental Pricing in Antwerp: A Machine Learning Approach

Let's start this with Data Understanding phase of the CRISP-DM process.
- The number of rows and columns in each dataset.
- A preview of the first few rows to understand the data types and values.
- Summary statistics for numerical columns to get a sense of the data distribution.
- The presence of missing values.

In [2]:
import pandas as pd

In [3]:
# cal_df = pd.read_csv("calendar.csv")
# cal_df.head()

In [4]:
# host_df = pd.read_csv('hosts.csv')
# host_df.head()

In [5]:
# list_df = pd.read_csv('listings.csv')
# list_df.head()

In [6]:
# display(df.head())

In [7]:
import os
os.listdir()

['.ipynb_checkpoints',
 'AirBnb.ipynb',
 'AirBnb_Problem statement and data.docx',
 'calendar.csv',
 'hosts.csv',
 'listings.csv',
 'reviews.csv']

In [8]:
import pandas as pd

# Load the datasets
calendar_df = pd.read_csv('calendar.csv')
hosts_df = pd.read_csv('hosts.csv')
reviews_df = pd.read_csv('reviews.csv')
listings_df = pd.read_csv('listings.csv')

# Inspect the first few rows of each dataset and their info
datasets = {
    'calendar': calendar_df,
    'hosts': hosts_df,
    'reviews': reviews_df,
    'listings': listings_df
}

# Displaying the first few rows and basic info for each dataset
for name, df in datasets.items():
    print(f"Dataset: {name.upper()}")
    display(df.head())
    display(df.info())
    print("\n" + "-"*50 + "\n")

Dataset: CALENDAR

,calender_id,listing_id,date,available,price,adjusted_price,minimum_nights,maximum_nights
0,1,40334325,2022-08-03 00:00:00.000000,0,56.0,56.0,3,5
1,2,22742449,2022-11-13 00:00:00.000000,1,95.0,95.0,2,99
2,3,34621717,2022-04-17 00:00:00.000000,0,75.0,75.0,2,1125
3,4,38281744,2022-01-31 00:00:00.000000,1,150.0,150.0,1,1000
4,5,18835003,2022-05-21 00:00:00.000000,0,100.0,100.0,2,1125

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 319192 entries, 0 to 319191
Data columns (total 8 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   calender_id     319192 non-null  int64
 1   listing_id      319192 non-null  int64
 2   date            319192 non-null  object
 3   available       319192 non-null  int64
 4   price           319117 non-null  float64
 5   adjusted_price  319117 non-null  float64
 6   minimum_nights  319192 non-null  int64
 7   maximum_nights  319192 non-null  int64
dtypes: float64(2), int64(5), object(1)
memory usage: 19.5+ MB

None

--------------------------------------------------

Dataset: HOSTS

,host_id,host_name,host_since,host_location,host_about
0,234077,Karin,2010-09-14 00:00:00.000000,"Antwerp, Flanders, Belgium",Ever since my childhood I dreamt of having my ...
1,334804,Ann,2011-01-04 00:00:00.000000,"Antwerp, Flemish Region, Belgium","Ciao, \r\nlooking forward to meet you!\r\nI lo..."
2,413052,Valérie,2011-02-27 00:00:00.000000,"Antwerp, Flanders, Belgium",NaN
3,452791,Tatiana,2011-03-20 00:00:00.000000,"Antwerp, Flanders, Belgium",World traveler with a penchant for adrenaline ...
4,462975,Els,2011-03-25 00:00:00.000000,"Edegem, Flanders, Belgium",I studied languages and cultural anthropology ...

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1111 entries, 0 to 1110
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   host_id        1111 non-null   int64
 1   host_name      1111 non-null   object
 2   host_since     1111 non-null   object
 3   host_location  1108 non-null   object
 4   host_about     490 non-null    object
dtypes: int64(1), object(4)
memory usage: 43.5+ KB

None

--------------------------------------------------

Dataset: REVIEWS

,review_id,listing_id,date,reviewer_id,reviewer_name,comments
0,1,50904,2015-05-06 00:00:00.000000,19482395,Jihae,Karin’s “Aplace” is absolutely beautiful and c...
1,2,50904,2021-10-10 00:00:00.000000,333559,Emilie,"Karin is a wonderful host, she was really help..."
2,3,116134,2012-03-05 00:00:00.000000,928644,Aurélien,"Amazing flat, really close from the MAS Musem,..."
3,4,116134,2012-05-25 00:00:00.000000,231288,Gail,"This is a well equipped, very comfortable apar..."
4,5,116134,2013-09-03 00:00:00.000000,7984251,Marcel,This is a very nice appartement. We really lik...

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62987 entries, 0 to 62986
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   review_id      62987 non-null  int64
 1   listing_id     62987 non-null  int64
 2   date           62987 non-null  object
 3   reviewer_id    62987 non-null  int64
 4   reviewer_name  62987 non-null  object
 5   comments       62923 non-null  object
dtypes: int64(3), object(3)
memory usage: 2.9+ MB

None

--------------------------------------------------

Dataset: LISTINGS

,listing_id,listing_url,name,description,latitude,longitude,property_type,room_type,accomodates,bathrooms_text,bedrooms,beds,amenities,host_id
0,50904,https://www.airbnb.com/rooms/50904,aplace/antwerp: cosy suite - fashion district,Decorated in a vintage style combined with a f...,51.218575,4.398631,Room in boutique hotel,Hotel room,2,1 private bath,1.0,1.0,"[""Kitchen"", ""Smoke alarm"", ""Hair dryer"", ""Keyp...",234077
1,116134,https://www.airbnb.com/rooms/116134,Spacious apartment nearby Mas,Enjoy your stay at our 4 person apartment in t...,51.230510,4.405930,Entire rental unit,Entire home/apt,4,2.5 baths,2.0,2.0,"[""Refrigerator"", ""Elevator"", ""Paid street park...",586942
2,218916,https://www.airbnb.com/rooms/218916,Apartment with terrace in trendy Zurenborg,Do you enjoy authentic places with a lot of ch...,51.206330,4.429420,Entire condominium (condo),Entire home/apt,5,1 bath,1.0,3.0,"[""Paid street parking off premises"", ""Kitchen""...",915664
3,224333,https://www.airbnb.com/rooms/224333,Large stylish room in 1930s house + garden,"Large bedroom in classic 1930s house. Kitchen,...",51.197720,4.458530,Private room in residential home,Private room,2,2 shared baths,1.0,1.0,"[""Fire extinguisher"", ""Backyard"", ""Long term s...",1167377
4,224682,https://www.airbnb.com/rooms/224682,APARTMENT ROSCAM - OLD CENTRE ANTWERP,"<b>The space</b><br />Apartment ""Roscam"" is a ...",51.217220,4.397900,Entire rental unit,Entire home/apt,3,1 bath,1.0,2.0,"[""Refrigerator"", ""Kitchen"", ""Smoke alarm"", ""Sh...",1263933

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1749 entries, 0 to 1748
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   listing_id      1749 non-null   int64
 1   listing_url     1749 non-null   object
 2   name            1749 non-null   object
 3   description     1679 non-null   object
 4   latitude        1749 non-null   float64
 5   longitude       1749 non-null   float64
 6   property_type   1749 non-null   object
 7   room_type       1749 non-null   object
 8   accomodates     1749 non-null   int64
 9   bathrooms_text  1749 non-null   object
 10  bedrooms        1621 non-null   float64
 11  beds            1708 non-null   float64
 12  amenities       1749 non-null   object
 13  host_id         1749 non-null   int64
dtypes: float64(4), int64(3), object(7)
memory usage: 191.4+ KB

None

--------------------------------------------------

# Task1: Data Understanding and Feature Creation
## Calendar Table Analysis
- **Count Rows and Unique Listing IDs:** Determine the total number of rows and the number of unique listings in the calendar.csv dataset. This will help understand the data's granularity and identify if multiple records exist for each listing (implying repeated observations over time).
- **Price Column Transformation:** The price column will serve as our target variable. We need to ensure it's in a numerical format suitable for regression analysis. Any missing values will also need to be addressed, either by removal or imputation.

In [9]:
# Count the total number of rows in the Calendar dataset
total_rows_calendar = calendar_df.shape[0]

# Count the number of unique listing IDs in the Calendar dataset
unique_listing_ids_calendar = calendar_df['listing_id'].nunique()

total_rows_calendar, unique_listing_ids_calendar

(319192, 1749)

In [10]:
calendar_df

,calender_id,listing_id,date,available,price,adjusted_price,minimum_nights,maximum_nights
0,1,40334325,2022-08-03 00:00:00.000000,0,56.0,56.0,3,5
1,2,22742449,2022-11-13 00:00:00.000000,1,95.0,95.0,2,99
2,3,34621717,2022-04-17 00:00:00.000000,0,75.0,75.0,2,1125
3,4,38281744,2022-01-31 00:00:00.000000,1,150.0,150.0,1,1000
4,5,18835003,2022-05-21 00:00:00.000000,0,100.0,100.0,2,1125
...,...,...,...,...,...,...,...,...
319187,319188,52729945,2022-07-06 00:00:00.000000,1,64.0,64.0,1,10
319188,319189,36953202,2022-07-08 00:00:00.000000,0,140.0,140.0,3,1125
319189,319190,39580214,2022-06-13 00:00:00.000000,1,49.0,49.0,1,13
319190,319191,49016014,2022-10-26 00:00:00.000000,0,60.0,60.0,2,30
319191,319192,31438714,2022-06-12 00:00:00.000000,0,104.0,104.0,2,1125

In [12]:
calendar_df.isnull().sum()

calender_id        0
listing_id         0
date               0
available          0
price             75
adjusted_price    75
minimum_nights     0
maximum_nights     0
dtype: int64

In [14]:
calendar_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 319192 entries, 0 to 319191
Data columns (total 8 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   calender_id     319192 non-null  int64
 1   listing_id      319192 non-null  int64
 2   date            319192 non-null  object
 3   available       319192 non-null  int64
 4   price           319117 non-null  float64
 5   adjusted_price  319117 non-null  float64
 6   minimum_nights  319192 non-null  int64
 7   maximum_nights  319192 non-null  int64
dtypes: float64(2), int64(5), object(1)
memory usage: 19.5+ MB

In [18]:
calendar_df[calendar_df['price'].isnull()]

,calender_id,listing_id,date,available,price,adjusted_price,minimum_nights,maximum_nights
2648,2649,37025979,2022-03-20 00:00:00.000000,0,NaN,NaN,3,15
5035,5036,37025979,2022-05-18 00:00:00.000000,0,NaN,NaN,3,15
5928,5929,37025979,2022-01-14 00:00:00.000000,0,NaN,NaN,3,15
6042,6043,45416364,2022-12-18 00:00:00.000000,0,NaN,NaN,30,1125
6462,6463,37025979,2021-12-30 00:00:00.000000,0,NaN,NaN,3,15
...,...,...,...,...,...,...,...,...
294812,294813,37025979,2022-04-04 00:00:00.000000,0,NaN,NaN,3,15
297040,297041,37025979,2022-05-28 00:00:00.000000,0,NaN,NaN,3,15
308576,308577,37025979,2022-04-05 00:00:00.000000,0,NaN,NaN,3,15
310417,310418,37025979,2022-04-18 00:00:00.000000,0,NaN,NaN,3,15
315594,315595,37025979,2022-04-20 00:00:00.000000,0,NaN,NaN,3,15

###

In [22]:
calendar_df['price'].plot(kind = 'boxplot')

ValueError: boxplot is not a valid plot kind